Revit 2027 API
RebarBendingDetail.RemoveHosts Method
 Remove the reinforcement elements from those represented by the input bending detail.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RemoveHosts(
	Element bendingDetail,
	IList<Reference> references
)
Public Shared Sub RemoveHosts (
	bendingDetail As Element,
	references As IList(Of Reference)
)
public:
static void RemoveHosts(
	Element^ bendingDetail,
	IList<Reference^>^ references
)
static member RemoveHosts :
        bendingDetail : Element *
        references : IList<Reference> -> unit
Parameters
bendingDetail Element
 The bending detail for which we want to set the host.
references IList<Reference>
 References pointing to the reinforcement element that will be removed from the input bending detail.
Exceptions
Exception | Condition
ArgumentException |  -or- This option is only available for schematic bending detail elements.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace